//给你一个4位整数n，求它的各位数字之和。
//输入格式：一个整数n。1000<n<9999。
//输出格式：一个整数，表示n的各位数字之和。
#include <stdio.h>

int main() {
    int n;
    scanf("%d", &n);
    printf("请输入一个四位数:");
    // 拆分每一位：千位、百位、十位、个位
    int qian = n / 1000;       // 4位数除以1000得到千位（如1234/1000=1）
    int bai = n / 100 % 10;    // 除以100取整后，对10取余得到百位（1234/100=12，12%10=2）
    int shi = n / 10 % 10;     // 除以10取整后，对10取余得到十位（1234/10=123，123%10=3）
    int ge = n % 10;           // 对10取余得到个位（1234%10=4
    // 计算各位之和
    int sum = qian + bai + shi + ge;
    printf("%d\n", sum);
    return 0;
}